CLASSES.md
```mermaid
sequenceDiagram
    participant A as Information
    participant B as LocaleInformation
    participant C as Polarity
    participant D as Handler
    participant F as Ray
    participant G as Renderer

    A ->> A: polarity
    A ->> A: polarityBetween(other: Information)
    A ->> A: static NULL
    A ->> A: toString()
    A ->> A: clone()

    B ->> B: position
    B ->> B: velocity
    B ->> B: rotation
    B ->> B: mass
    B ->> B: time
    B ->> B: update()
    B ->> B: clearQueue()
    B ->> B: forceBetween(other: LocaleInformation)
    B ->> B: visibleObjects()
    B ->> B: updateLocaleInformation(info: LocaleInformation)
    B ->> B: removeLocaleInformation(info: LocaleInformation)
    B ->> B: has(info: LocaleInformation | Environment)
    B ->> B: get(info: LocaleInformation | Environment)
    B ->> B: set(info: LocaleInformation, value: LocaleInformation)
    B ->> B: values()
    B ->> B: on(event: string, eventHandler: Handler)
    B ->> B: off(event: string, eventHandler: Handler)
    B ->> B: once(event: string, eventHandler: Handler)
    B ->> B: emit(event: string, info: LocaleInformation)
    B ->> B: toString()
    B ->> B: clone()

    C ->> C: absorb
    C ->> C: listen
    C ->> C: execute
    C ->> C: mediate
    C ->> C: emit
    C ->> C: set(absorb: number, listen: number, execute: number, mediate: number, emit: number)
    C ->> C: get()
    C ->> C: toString()
    C ->> C: clone()

    D ->> D: target
    D ->> D: constructor(event: string, callback: Function, executeOnce: boolean)
    D ->> D: handle(event: string, info: LocaleInformation)

    E ->> E: addLocaleInformation(info: LocaleInformation, position: Vector3, radius: Vector3)
    E ->> E: updateLocaleInformation(info: LocaleInformation)
    E ->> E: removeLocaleInformation(info: LocaleInformation)
    E ->> E: update()
    E ->> E: clearQueue()
    E ->> E: on(event: string, eventHandler: Handler)
    E ->> E: off(event: string, eventHandler: Handler)
    E ->> E: once(event: string, eventHandler: Handler)
    E ->> E: toString()
    E ->> E: clone()

    F ->> F: intersectsSphere(ray: Ray, radius: number)

    G ->> G: render(position: Vector3, direction: Vector3, radius: Vector3)
```
